STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_crs.c
#if defined(USE_HAL_CRS_MODULE) && (USE_HAL_CRS_MODULE == 1U)
#if defined (CRS)

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup CRS_Private_Constants CRS Private Constants
  * @{
  */
#if !defined(USB_OTG_HS)
#define CRS_SYNC_SOURCE_DEFAULT LL_CRS_SYNC_SOURCE_USB      /*!< Default synchronization source set to USB */
#else
#define CRS_SYNC_SOURCE_DEFAULT CRS_CFGR_SYNCSRC_1          /*!< Default synchronization source */
#endif /* !USB_OTG_HS */
/**
  * @}
  */
/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup CRS_Private_Macros CRS Private Macros
  * @{
  */
/**
  * @brief Synchronization source
  */
#if !defined(USB_OTG_HS)
#define IS_CRS_SYNC_SOURCE(source) (((source) == HAL_CRS_SYNC_SOURCE_GPIO) \
                                    || ((source) == HAL_CRS_SYNC_SOURCE_LSE) \
                                    || ((source) == HAL_CRS_SYNC_SOURCE_USB))
#else
#define IS_CRS_SYNC_SOURCE(source) (((source) == HAL_CRS_SYNC_SOURCE_GPIO) \
                                    || ((source) == HAL_CRS_SYNC_SOURCE_LSE))
#endif /* !USB_OTG_HS */

/**
  * @brief Synchronization divider
  */
#define IS_CRS_SYNC_DIVIDER(div)       (((div) == HAL_CRS_SYNC_DIV1) || ((div) == HAL_CRS_SYNC_DIV2) \
                                        || ((div) == HAL_CRS_SYNC_DIV4) || ((div) == HAL_CRS_SYNC_DIV8) \
                                        || ((div) == HAL_CRS_SYNC_DIV16) || ((div) == HAL_CRS_SYNC_DIV32) \
                                        || ((div) == HAL_CRS_SYNC_DIV64) || ((div) == HAL_CRS_SYNC_DIV128))

/**
  * @brief Synchronization polarity
  */
#define IS_CRS_SYNC_POLARITY(polarity)     (((polarity) == HAL_CRS_SYNC_POLARITY_RISING) \
                                            || ((polarity) == HAL_CRS_SYNC_POLARITY_FALLING))

/**
  * @brief Reload
  */
#define IS_CRS_RELOAD(value)  (((value) <= 0xFFFFU))

/**
  * @brief Frequency error limit
  */
#define IS_CRS_FREQUENCY_ERROR_LIMIT(value)   (((value) <= 0xFFU))

/**
  * @brief Trimming
  */
#define IS_CRS_TRIMMING(value) (((value) <= 0x7FU))

/**
  * @brief Auto trimming
  */
#define IS_CRS_AUTO_TRIMMING(state)            (((state) == HAL_CRS_AUTO_TRIMMING_DISABLE) \
                                                || ((state) == HAL_CRS_AUTO_TRIMMING_ENABLE))

/**
  * @brief Instance
  */
#define CRS_INSTANCE(hcrs)            ((CRS_TypeDef *)((uint32_t)(hcrs)->instance))

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup CRS_Exported_Functions
  * @{
  */

/** @addtogroup CRS_Exported_Functions_Group1
  * @{

This section provides a set of functions allowing to initialize and deinitialize the CRS peripheral:

- Call the function HAL_CRS_Init() to initialize the selected CRS handle and associate an instance.
- Call the function HAL_CRS_DeInit() to deinitialize the CRS.
  */

/**
  * @brief  Initialize the CRS according to the associated handle.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS.
  * @param  instance CRS instance.
  * @retval HAL_INVALID_PARAM When the handle is NULL.
  * @retval HAL_OK            HAL CRS driver correctly initialized for the given CRS instance.
  */
hal_status_t HAL_CRS_Init(hal_crs_handle_t *hcrs, hal_crs_t instance)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(IS_CRS_ALL_INSTANCE((CRS_TypeDef *)(uint32_t)instance));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the handle struct pointer */
  if (hcrs == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcrs->instance = instance;

#if defined(USE_HAL_CRS_CLK_ENABLE_MODEL) && (USE_HAL_CRS_CLK_ENABLE_MODEL == HAL_CLK_ENABLE_PERIPH_ONLY)
  HAL_RCC_CRS_EnableClock();
#endif /* USE_HAL_CRS_CLK_ENABLE_MODEL */

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
  /* Initialize the CRS callback settings */
  hcrs->p_error_cb         = HAL_CRS_ErrorCallback;        /* Error callback */
  hcrs->p_sync_ok_cb       = HAL_CRS_SyncOkCallback;       /* Synchronization ok callback */
  hcrs->p_sync_warn_cb     = HAL_CRS_SyncWarnCallback;     /* Synchronization warning callback */
  hcrs->p_expected_sync_cb = HAL_CRS_ExpectedSyncCallback; /* Expected synchronization callback */
#endif  /* USE_HAL_CRS_REGISTER_CALLBACKS */

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  hcrs->global_state = HAL_CRS_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  DeInitialize the CRS.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  */
void HAL_CRS_DeInit(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(IS_CRS_ALL_INSTANCE((CRS_TypeDef *)(uint32_t)hcrs->instance));

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  /* Stop the CRS */
  LL_CRS_DisableFreqErrorCounter(CRS_INSTANCE(hcrs));

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  hcrs->global_state = HAL_CRS_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group2
  * @{

This section provides a set of functions allowing to configure the CRS driver:

