STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_crs.c
- Call the function HAL_CRS_SetConfig() to set the different fields needed before starting the CRS driver.
- Call the function HAL_CRS_GetConfig() to retrieve the configuration.
- Call the function HAL_CRS_ResetConfig() to reset the configuration to its default values.
- Call the function HAL_CRS_SetTrimming() to set the trimming value.
- Call the function HAL_CRS_GetTrimming() to retrieve the trimming value.
- Call the function HAL_CRS_GetFrequencyErrorInfo() to retrieve frequency error information.
  */

/**
  * @brief  Configure the CRS driver.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param  p_config Pointer on @ref hal_crs_config_t structure.
  * @note   This function is optional, the user can start the driver with the default configuration.
  * @retval HAL_OK CRS instance has been correctly configured.
  * @retval HAL_INVALID_PARAM When the p_config pointer is NULL.
  */
hal_status_t HAL_CRS_SetConfig(hal_crs_handle_t *hcrs, const hal_crs_config_t *p_config)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the config struct pointer */
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_CRS_SYNC_DIVIDER(p_config->divider));
  ASSERT_DBG_PARAM(IS_CRS_SYNC_SOURCE(p_config->source));
  ASSERT_DBG_PARAM(IS_CRS_SYNC_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_CRS_RELOAD(p_config->reload));
  ASSERT_DBG_PARAM(IS_CRS_FREQUENCY_ERROR_LIMIT(p_config->frequency_error_limit));
  ASSERT_DBG_PARAM(IS_CRS_TRIMMING(p_config->trimming));
  ASSERT_DBG_PARAM(IS_CRS_AUTO_TRIMMING(p_config->auto_trimming));

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  p_crsx = CRS_INSTANCE(hcrs);

  LL_CRS_ConfigTrimming(p_crsx, p_config->trimming, (uint32_t)p_config->auto_trimming);

  LL_CRS_ConfigSynchronization(p_crsx, (uint32_t)p_config->divider | (uint32_t)p_config->source |
                               (uint32_t)p_config->polarity, p_config->reload, p_config->frequency_error_limit);
  return HAL_OK;
}

/**
  * @brief  Get the configuration.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param  p_config Pointer on @ref hal_crs_config_t structure.
  */
void HAL_CRS_GetConfig(const hal_crs_handle_t *hcrs, hal_crs_config_t *p_config)
{
  const CRS_TypeDef *p_crsx;
  uint32_t config;
  uint32_t trimming_config;

  ASSERT_DBG_PARAM(hcrs != NULL);
  /* Check config allocation */
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  p_crsx = (const CRS_TypeDef *)((uint32_t)hcrs->instance);

  config = LL_CRS_READ_REG(p_crsx, CFGR);
  trimming_config = LL_CRS_READ_REG(p_crsx, CR);

  p_config->divider = (hal_crs_sync_div_t)(uint32_t)(config & CRS_CFGR_SYNCDIV);
  p_config->source = (hal_crs_sync_source_t)(uint32_t)(config & CRS_CFGR_SYNCSRC);
  p_config->polarity = (hal_crs_sync_polarity_t)(uint32_t)(config & CRS_CFGR_SYNCPOL);
  p_config->reload = (config & CRS_CFGR_RELOAD);
  p_config->frequency_error_limit = ((config & CRS_CFGR_FELIM) >> CRS_CFGR_FELIM_Pos);
  p_config->trimming = ((trimming_config & CRS_CR_TRIM) >> CRS_CR_TRIM_Pos);
  p_config->auto_trimming = (hal_crs_auto_trimming_state_t)(uint32_t)(trimming_config & CRS_CR_AUTOTRIMEN);
}

/**
  * @brief  Reset the following fields to their default values:
  *         - The divider is set to not divided.
  *         - The source is set to signal source 3.
  *         - The polarity is set to rising edge.
  *         - The reload is set to 0xBB7FU.
  *         - The felim is set to 0x22U.
  *         - The trimming is set to 0x40U.
  *         - The auto trimming is disabled.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  */
void HAL_CRS_ResetConfig(hal_crs_handle_t *hcrs)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  p_crsx = CRS_INSTANCE(hcrs);

  LL_CRS_DisableAutoTrimming(p_crsx);


  /* Reset the Control Register: trimming set to 0x40U and auto trimming disabled */
  LL_CRS_ConfigTrimming(p_crsx, LL_CRS_HSI48CALIBRATION_DEFAULT, LL_CRS_AUTO_TRIMMING_DISABLE);
  /**
    * Reset the Configuration Register: divider set to not divided, source set to signal source 3,
    * polarity set to rising edge, felim set to 0x22U and reload set to 0xBB7FU
    */
  LL_CRS_ConfigSynchronization(p_crsx, LL_CRS_SYNC_DIV_1 | CRS_SYNC_SOURCE_DEFAULT | LL_CRS_SYNC_POLARITY_RISING,
                               LL_CRS_RELOADVALUE_DEFAULT, LL_CRS_ERRORLIMIT_DEFAULT);

  /* Reset the Interrupt Flag Clear Register: clear ESYNC, ERR, SYNCWARN and SYNCOK flags */
  LL_CRS_ClearFlag(p_crsx, (LL_CRS_ICR_SYNCOKC | LL_CRS_ICR_SYNCWARNC | LL_CRS_ICR_ERRC | LL_CRS_ICR_ESYNCC));
}

/**
  * @brief  Set the trimming value.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param  trimming Trimming value.
  * @retval HAL_OK CRS instance has been correctly configured.
  * @retval HAL_ERROR Auto trimming enabled, configuration not possible.
  */
hal_status_t HAL_CRS_SetTrimming(hal_crs_handle_t *hcrs, uint32_t trimming)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(IS_CRS_TRIMMING(trimming));

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  p_crsx = CRS_INSTANCE(hcrs);

  /* Check if the auto trimming is disabled */
  if (LL_CRS_IsEnabledAutoTrimming(p_crsx) != 0U)
  {
    return HAL_ERROR;
  }
  LL_CRS_SetHSI48SmoothTrimming(p_crsx, trimming);
  return HAL_OK;
}

/**
  * @brief  Get the trimming value.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval uint32_t Trimming value.
  */
uint32_t HAL_CRS_GetTrimming(const hal_crs_handle_t *hcrs)
{
  const CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  p_crsx = (const CRS_TypeDef *)((uint32_t)hcrs->instance);
  return (LL_CRS_GetHSI48SmoothTrimming(p_crsx));
}

/**
  * @brief  Get frequency error information (frequency error capture and direction).
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param  p_frequency_error_info Pointer on @ref hal_crs_frequency_error_info_t structure.
  */
void HAL_CRS_GetFrequencyErrorInfo(const hal_crs_handle_t *hcrs,
                                   hal_crs_frequency_error_info_t *p_frequency_error_info)
{
  const CRS_TypeDef *p_crsx;
  uint32_t info;

  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_frequency_error_info != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  p_crsx = (const CRS_TypeDef *)((uint32_t)hcrs->instance);

