STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_crs.c
  info = LL_CRS_GetFreqErrorInfo(p_crsx);

  /* Get Frequency error capture */
  p_frequency_error_info->frequency_error_capture = LL_CRS_READ_FREQ_ERROR_CAPTURE(info);

  /* Get Frequency error direction */
  p_frequency_error_info->frequency_error_dir = (hal_crs_frequency_error_dir_t)(uint32_t)
                                                LL_CRS_READ_FREQ_ERROR_DIRECTION(info);
}

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group3
  * @{

This section provides a set of functions allowing to start/stop the CRS driver and control the auto trimming:

- Call the functions HAL_CRS_EnableAutoTrimming(), HAL_CRS_DisableAutoTrimming() and HAL_CRS_IsEnabledAutoTrimming()
  to enable, disable the auto trimming and check if it is enabled or not.
- Call the function HAL_CRS_StartSync() to enable the frequency error counter.
- Call the function HAL_CRS_StopSync() to disable the frequency error counter.
- Call the function HAL_CRS_StartSync_IT() to enable the frequency error counter with interrupt sources.
- Call the function HAL_CRS_StopSync_IT() to disable the frequency error counter with interrupt sources.
  */

/**
  * @brief  Enable the auto trimming.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval HAL_OK CRS auto trimming has been correctly activated.
  */
hal_status_t HAL_CRS_EnableAutoTrimming(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  LL_CRS_EnableAutoTrimming(CRS_INSTANCE(hcrs));

  return HAL_OK;
}

/**
  * @brief  Disable the auto trimming.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval HAL_OK CRS auto trimming has been correctly de-activated.
  */
hal_status_t HAL_CRS_DisableAutoTrimming(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  LL_CRS_DisableAutoTrimming(CRS_INSTANCE(hcrs));

  return HAL_OK;
}

/**
  * @brief  Get the auto trimming status.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval HAL_CRS_AUTO_TRIMMING_DISABLED
  * @retval HAL_CRS_AUTO_TRIMMING_ENABLED
  */
hal_crs_auto_trimming_status_t HAL_CRS_IsEnabledAutoTrimming(const hal_crs_handle_t *hcrs)
{
  const CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  p_crsx = (const CRS_TypeDef *)((uint32_t)hcrs->instance);

  return (hal_crs_auto_trimming_status_t)LL_CRS_IsEnabledAutoTrimming(p_crsx);
}

/**
  * @brief  Start the CRS in Polling mode.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function enables the frequency error counter.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_StartSync(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  LL_CRS_EnableFreqErrorCounter(CRS_INSTANCE(hcrs));

  hcrs->global_state = HAL_CRS_STATE_ACTIVE;

  return HAL_OK;
}

/**
  * @brief  Stop the CRS in Polling mode.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function disables the frequency error counter.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_StopSync(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_ACTIVE);

  LL_CRS_DisableFreqErrorCounter(CRS_INSTANCE(hcrs));

  hcrs->global_state = HAL_CRS_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Start the CRS in Interrupt mode.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function enables the interrupt sources and the frequency error counter.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_StartSync_IT(hal_crs_handle_t *hcrs)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  p_crsx = CRS_INSTANCE(hcrs);

#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  LL_CRS_EnableIT(p_crsx, (LL_CRS_CR_SYNCOKIE | LL_CRS_CR_SYNCWARNIE | LL_CRS_CR_ERRIE | LL_CRS_CR_ESYNCIE));

  LL_CRS_EnableFreqErrorCounter(p_crsx);

  hcrs->global_state = HAL_CRS_STATE_ACTIVE;

  return HAL_OK;
}

/**
  * @brief  Stop the CRS in Interrupt mode.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function disables the interrupt sources and the frequency error counter.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_StopSync_IT(hal_crs_handle_t *hcrs)
{
  CRS_TypeDef *p_crsx;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_ACTIVE);

  p_crsx = CRS_INSTANCE(hcrs);

  LL_CRS_DisableFreqErrorCounter(p_crsx);

  LL_CRS_DisableIT(p_crsx, (LL_CRS_CR_SYNCOKIE | LL_CRS_CR_SYNCWARNIE | LL_CRS_CR_ERRIE | LL_CRS_CR_ESYNCIE));

  LL_CRS_ClearFlag(p_crsx, (LL_CRS_ICR_SYNCOKC | LL_CRS_ICR_SYNCWARNC | LL_CRS_ICR_ERRC | LL_CRS_ICR_ESYNCC));

  hcrs->global_state = HAL_CRS_STATE_IDLE;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group4
  * @{

This section provides a set of process functions:

- Call the function HAL_CRS_GenerateSoftwareSync() to generate a software synchronization event.
- Call the function HAL_CRS_PollForSync() to retrieve the status of synchronization event.
  */

/**
  * @brief  Generate the software synchronization event.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_CRS_GenerateSoftwareSync(hal_crs_handle_t *hcrs)
{
  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_IDLE);

  LL_CRS_GenerateEvent_SWSYNC(CRS_INSTANCE(hcrs));

  return HAL_OK;
}

/**
  * @brief  Retrieve the status of synchronization.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @param timeout_ms  Duration of the timeout in milliseconds.
  * @note  timeout_ms is based on the maximum time to receive a SYNC event based on synchronization
  *        frequency.
  * @warning  If timeout_ms set to HAL_MAX_DELAY, HAL_TIMEOUT is never returned.
  * @retval HAL_OK Synchronization event OK (SYNCOK).
  * @retval HAL_ERROR Synchronization error or warning (SYNCERR, TRIMOVF, SYNCMISS or SYNCWARN).
  * @retval HAL_TIMEOUT Timeout elapsed.
  */
hal_status_t HAL_CRS_PollForSync(hal_crs_handle_t *hcrs, uint32_t timeout_ms)
{
  CRS_TypeDef *p_crsx;
  uint32_t tickstart;
  uint32_t flags;

  ASSERT_DBG_PARAM(hcrs != NULL);

  ASSERT_DBG_STATE(hcrs->global_state, HAL_CRS_STATE_ACTIVE);

  p_crsx = CRS_INSTANCE(hcrs);

  /* Get timeout */
  tickstart = HAL_GetTick();

