STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_crs.c
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
  hcrs->last_error_codes = HAL_CRS_ERROR_NONE;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

  do
  {
    flags = LL_CRS_READ_REG(p_crsx, ISR);

    /* Check CRS Expected SYNC flag */
    if ((flags & LL_CRS_ISR_ESYNCF) != 0U)
    {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
      hcrs->last_error_codes |= HAL_CRS_ERROR_EXPECTED_SYNC;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

      LL_CRS_ClearFlag_ESYNC(p_crsx);
    }

    /* Check CRS SYNCOK flag */
    if ((flags & LL_CRS_ISR_SYNCOKF) != 0U)
    {
      LL_CRS_ClearFlag_SYNCOK(p_crsx);

      return HAL_OK;
    }

    /* Check CRS ERR and SYNCWARN flags */
    if (((flags & LL_CRS_ISR_ERRF) == 0U) && ((flags & LL_CRS_ISR_SYNCWARNF) == 0U))
    {
      flags = 0U;
    }
    else /* Error flag or SYNC warning flag set */
    {
      if ((flags & LL_CRS_ISR_TRIMOVF) != 0U)
      {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
        hcrs->last_error_codes |= HAL_CRS_ERROR_TRIMMING;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
      }

      if ((flags & LL_CRS_ISR_SYNCERR) != 0U)
      {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
        hcrs->last_error_codes |= HAL_CRS_ERROR_SYNC_ERROR;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
      }

      if ((flags & LL_CRS_ISR_SYNCMISS) != 0U)
      {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
        hcrs->last_error_codes |= HAL_CRS_ERROR_SYNC_MISSED;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
      }

      if ((flags & LL_CRS_ISR_SYNCWARNF) != 0U)
      {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
        hcrs->last_error_codes |= HAL_CRS_ERROR_SYNC_WARN;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
      }

      LL_CRS_ClearFlag(p_crsx, LL_CRS_ICR_ERRC | LL_CRS_ICR_SYNCWARNC);
    }

    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  } while (flags == 0U);

  return HAL_ERROR;
}

/**
  * @}
  */

/** @addtogroup CRS_Exported_Functions_Group5
  * @{

This section provides functions allowing to:
 - Handle the CRS interrupt request with HAL_CRS_IRQHandler().
There are two ways to use callbacks: override weak callback functions or register user callback functions.
They are used to indicate :
 - When the CRS driver encounters an error (HAL_CRS_ErrorCallback() or callback function registered with
   HAL_CRS_RegisterErrorCallback()). The errors can be synchronization missed, synchronization error or
   trimming overflow or underflow.
 - When a synchronization event ok is triggered (HAL_CRS_SyncOkCallback()
   or callback function registered with HAL_CRS_RegisterSyncOkCallback()).
 - When a synchronization warning is triggered (HAL_CRS_SyncWarnCallback()
   or callback function registered with HAL_CRS_RegisterSyncWarnCallback()).
 - When an expected synchronization is triggered (HAL_CRS_ExpectedSyncCallback()
   or callback function registered with HAL_CRS_RegisterExpectedSyncCallback()).
  */

/**
  * @brief  Handle the Clock Recovery System interrupt request.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note  This function must be called from CRS_IRQHandler().
  */
void HAL_CRS_IRQHandler(hal_crs_handle_t *hcrs)
{
  CRS_TypeDef *p_crsx;
  uint32_t it_flags_sources;

  ASSERT_DBG_PARAM(hcrs != NULL);

  p_crsx = CRS_INSTANCE(hcrs);

  /* Get current IT flags and IT sources values */
  it_flags_sources = LL_CRS_READ_REG(p_crsx, ISR);
  it_flags_sources &= LL_CRS_READ_REG(p_crsx, CR);

  /* Check CRS SYNCOK flag  */
  if ((it_flags_sources & LL_CRS_ISR_SYNCOKF) != 0U)
  {
    LL_CRS_ClearFlag_SYNCOK(p_crsx);

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
    hcrs->p_sync_ok_cb(hcrs);
#else
    HAL_CRS_SyncOkCallback(hcrs);
#endif /* USE_HAL_CRS_REGISTER_CALLBACKS */
  }
  /* Check CRS SYNCWARN flag  */
  if ((it_flags_sources & LL_CRS_ISR_SYNCWARNF) != 0U)
  {
    LL_CRS_ClearFlag_SYNCWARN(p_crsx);

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
    hcrs->p_sync_warn_cb(hcrs);
#else
    HAL_CRS_SyncWarnCallback(hcrs);
#endif /* USE_HAL_CRS_REGISTER_CALLBACKS */
  }
  /* Check CRS Expected SYNC flag */
  if ((it_flags_sources & LL_CRS_ISR_ESYNCF) != 0U)
  {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
    hcrs->last_error_codes = HAL_CRS_ERROR_EXPECTED_SYNC;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */

    LL_CRS_ClearFlag_ESYNC(p_crsx);

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
    hcrs->p_expected_sync_cb(hcrs);
#else
    HAL_CRS_ExpectedSyncCallback(hcrs);
#endif /* USE_HAL_CRS_REGISTER_CALLBACKS */
  }
  /* Check CRS Error flags */
  if ((it_flags_sources & LL_CRS_ISR_ERRF) != 0U)
  {

    if ((LL_CRS_IsActiveFlag_SYNCERR(p_crsx)) != 0U)
    {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
      hcrs->last_error_codes = HAL_CRS_ERROR_SYNC_ERROR;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
    }
    else if ((LL_CRS_IsActiveFlag_SYNCMISS(p_crsx)) != 0U)
    {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
      hcrs->last_error_codes = HAL_CRS_ERROR_SYNC_MISSED;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
    }
    else /* Trimming overflow or underflow flag set */
    {
#if defined(USE_HAL_CRS_GET_LAST_ERRORS) && (USE_HAL_CRS_GET_LAST_ERRORS == 1U)
      hcrs->last_error_codes = HAL_CRS_ERROR_TRIMMING;
#endif /* USE_HAL_CRS_GET_LAST_ERRORS */
    }

    LL_CRS_ClearFlag_ERR(p_crsx);

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
    hcrs->p_error_cb(hcrs);
#else
    HAL_CRS_ErrorCallback(hcrs);
#endif /* USE_HAL_CRS_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Clock Recovery System SYNCOK interrupt callback.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function must not be modified in this file, but must preferably be implemented in the user file.
  */
__WEAK void HAL_CRS_SyncOkCallback(hal_crs_handle_t *hcrs)
{
  STM32_UNUSED(hcrs);
}

/**
  * @brief  Clock Recovery System SYNCWARN interrupt callback.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function must not be modified in this file, but must preferably be implemented in the user file.
  */
__WEAK void HAL_CRS_SyncWarnCallback(hal_crs_handle_t *hcrs)
{
  STM32_UNUSED(hcrs);
}

/**
  * @brief  Clock Recovery System Expected SYNC interrupt callback.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function must not be modified in this file, but must preferably be implemented in the user file.
  */
__WEAK void HAL_CRS_ExpectedSyncCallback(hal_crs_handle_t *hcrs)
{
  STM32_UNUSED(hcrs);
}

/**
  * @brief  Clock Recovery System Error interrupt callback.
  * @param  hcrs Pointer to a hal_crs_handle_t structure that contains
  *              the handle information for the specified CRS instance.
  * @note   This function must not be modified in this file, but must preferably be implemented in the user file.
  */
__WEAK void HAL_CRS_ErrorCallback(hal_crs_handle_t *hcrs)
{
  STM32_UNUSED(hcrs);
}

#if defined(USE_HAL_CRS_REGISTER_CALLBACKS) && (USE_HAL_CRS_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User CRS callback for synchronization ok.
  * @param  hcrs Pointer to the CRS handle.
  * @param  p_callback Pointer to the synchronization ok callback function.
  * @retval HAL_OK  Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CRS_RegisterSyncOkCallback(hal_crs_handle_t *hcrs, hal_crs_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  hcrs->p_sync_ok_cb = p_callback;
  return HAL_OK;
}

/**
  * @brief  Register a User CRS callback for synchronization warning.
  * @param  hcrs Pointer to the CRS handle.
  * @param  p_callback Pointer to the synchronization warning callback function.
  * @retval HAL_OK  Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CRS_RegisterSyncWarnCallback(hal_crs_handle_t *hcrs, hal_crs_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  hcrs->p_sync_warn_cb = p_callback;
  return HAL_OK;
}

/**
  * @brief  Register a User CRS callback for expected synchronization.
  * @param  hcrs Pointer to the CRS handle.
  * @param  p_callback Pointer to the expected synchronization callback function.
  * @retval HAL_OK  Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CRS_RegisterExpectedSyncCallback(hal_crs_handle_t *hcrs, hal_crs_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

  hcrs->p_expected_sync_cb = p_callback;
  return HAL_OK;
}

/**
  * @brief  Register a User CRS callback for error.
  * @param  hcrs Pointer to the CRS handle.
  * @param  p_callback Pointer to the error callback function.
  * @retval HAL_OK  Register completed successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_CRS_RegisterErrorCallback(hal_crs_handle_t *hcrs, hal_crs_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hcrs != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hcrs->global_state, (uint32_t)HAL_CRS_STATE_IDLE | (uint32_t)HAL_CRS_STATE_ACTIVE);

